Tasks/ИА_ЗадачаПланаДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Task>
		<Properties>
			<Name>ИА_ЗадачаПланаДействий</Name>
			<Addressing>InformationRegister.ИА_АдресацияЗадачПланаДействий</Addressing>
			<BasedOn>
				<xr:Item>Task.ИА_ЗадачаПланаДействий</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданаИзПлана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отложена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПослание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЗРС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СМСОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоКомлиниям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостАвтора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминатьС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминатьПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ситуация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрикрепленныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_РегламентныеЗадачиКоммцентра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлена</Name>
					<Comment>призна того что была нажата кнопка Отправить</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительЗРС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_ТочкаБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_ВариантУсловияБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_ИсключенаИзОбработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_БПДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПереписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтклонениеЗРС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗРСП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СитуацияТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокладОбИсполнении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаСУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_СтратегическоеУправление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКоррекцияСУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительОтказЗРС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаявкаНаОбязательства</v8:Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
						<v8:Type>cfg:TaskRef.ИА_ЗадачаПланаДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСУ_ПриоритетЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ХодВыполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоКомментарий</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маршрут</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пост</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсеВерно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПодтверждения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МаршрутПередачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подзадачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнил</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

InformationRegisters/ИА_ГруппыКЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ГруппыКЦ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ГруппыКЦ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_НовыеЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_НовыеЗадачи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Tasks/ИА_ЗадачаПланаДействий/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	если ОбменДанными.Загрузка Тогда
		возврат;
	КонецЕсли;
	
	Если Приоритет.Пустая() и не ЭтоПослание Тогда
		Приоритет = Перечисления.КСУ_ПриоритетЗадачи.Средний;
	КонецЕсли;
		
	Если Автор.Пустая() тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Взаимодействия1с = Константы.КСУ_КЦ_ИспользоватьВзаимодействия1С.Получить();
	
	ТекстКомм = "";
	Если ЭтоПослание и ЭтоНовый() Тогда
		ТекстКомм = "Послание отправлено";
	ИначеЕсли ЭтоНовый() и не ЭтотОбъект.Отправлена Тогда
		ТекстКомм = "Черновик записан";
	ИначеЕсли ЭтотОбъект.Отправлена и не Ссылка.Отправлена Тогда
		Если ЭтоЗРС Тогда
			ТекстКомм = "ЗРС отправлена";
		Иначе
			ТекстКомм = "Задача отправлена";
		КонецЕсли;
	КонецЕсли;
	
	Если ТекстКомм <> "" Тогда
		Если ЭтоНовый() Тогда
			уид = новый УникальныйИдентификатор;
			сс = Задачи.ИА_ЗадачаПланаДействий.ПолучитьСсылку(уид);
			УстановитьСсылкуНового(сс);
		КонецЕсли;
		ДобавитьКоммент(Взаимодействия1с, ЭтотОбъект, ТекстКомм);
	КонецЕсли;
	
	// установка пометки удаления
	Если ПометкаУдаления и не Ссылка.ПометкаУдаления Тогда
		ТекЮзер = ПараметрыСеанса.ТекущийПользователь;
		Если ТекЮзер <> Автор Тогда
			Сообщить("Удалять задачи может только автор!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
				
		ДобавитьКоммент(Взаимодействия1с, ЭтотОбъект, "Задача удалена");

		Пост = Справочники.ОргСхема.ПустаяСсылка();
		Пользователь = Автор;
		
		Выполнена = истина;
	КонецЕсли;
	
	// снятие пометки удаления
	Если (не ПометкаУдаления) и Ссылка.ПометкаУдаления Тогда
		ТекЮзер = ПараметрыСеанса.ТекущийПользователь;
		Если ТекЮзер <> Автор Тогда
			Сообщить("Отменять удаление задачи может только автор!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ДобавитьКоммент(Взаимодействия1с, ЭтотОбъект, "Задача восстановлена");
		
		Выполнена = ложь;
	КонецЕсли;
	
	Если ПостАвтора.Пустая() Тогда
		ПостАвтора = ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ПолучитьВысокийПостПользователя(Автор);
	КонецЕсли;
		
	// папки
	Если Выполнена Тогда
		// очистим все группы
		Набор = РегистрыСведений.ИА_ГруппыКЦ.СоздатьНаборЗаписей();
		Набор.Отбор.Задача.Установить(Ссылка);
		Набор.Записать(истина);
		
		// очистим все новые задачи
		Набор = РегистрыСведений.ИА_НовыеЗадачи.СоздатьНаборЗаписей();
		Набор.Отбор.Задача.Установить(Ссылка);
		Набор.Записать(истина);
	ИначеЕсли  (не ссылка.Пустая() и не Пользователь.Пустая() И (Пользователь <> Ссылка.Пользователь ИЛИ Пост <> Ссылка.Пост ИЛИ Отложена <> Ссылка.Отложена)) Тогда
		// очистим папки у нового адресата или при перемещении "В работе"
		Набор = РегистрыСведений.ИА_ГруппыКЦ.СоздатьНаборЗаписей();
		Набор.Отбор.Задача.Установить(Ссылка);
		Набор.Отбор.Пользователь.Установить(Пользователь);
		Набор.Записать(истина);
	КонецЕсли;
КонецПроцедуры

Функция ПечатьЗадачи() Экспорт
	
	Взаимодействия1с = Константы.КСУ_КЦ_ИспользоватьВзаимодействия1С.Получить();
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Макет");
	облшапка = Макет.ПолучитьОбласть("Шапка");
	облшапка.Параметры.Заполнить(ЭтотОбъект);
	ТабДок.Вывести(облшапка);
	
	облЗадачи = Макет.ПолучитьОбласть("Задача");
	облЗадачи.Параметры.Содержание = ?(СодержаниеТекст="", Содержание, СодержаниеТекст);
	ТабДок.Вывести(облЗадачи);
	
	облшапка2 = Макет.ПолучитьОбласть("Шапка2");
	облшапка2.Параметры.Заполнить(ЭтотОбъект);
	ТабДок.Вывести(облшапка2);
	
	Если Взаимодействия1с Тогда
		ход = ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ПолучитьТЗСообщенийОбсужденийзадачи(Ссылка); 
	Иначе
		ход = ХодВыполнения;
	КонецЕсли;
	
	Для каждого стр из ход Цикл
		облСтрока = Макет.ПолучитьОбласть("Строка");
		облСтрока.Параметры.Заполнить(стр);
		ТабДок.Вывести(облСтрока);
	КонецЦикла;
	
	ТабДок.МасштабПечати = 155;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	Возврат ТабДок;
	
КонецФункции

Функция ПечатьЗРС() Экспорт
	
	Взаимодействия1с = Константы.КСУ_КЦ_ИспользоватьВзаимодействия1С.Получить();
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("МакетЗРС");
	
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблШапка.Параметры.Заполнить(ЭтотОбъект);
	
	ТабДок.Вывести(ОблШапка);
	
	ТекущийПост         = ЭтотОбъект.Пост;
	ТекущийИсполнитель  = ЭтотОбъект.Исполнитель;
	ТекущийПользователь = ЭтотОбъект.Пользователь;
	// анализ комлиний
	Если Маршрут.Количество()=0 Тогда
		// без комлиний
		
		ОблКому = Макет.ПолучитьОбласть("Кому");
		
		Если  ИсполнительЗРС.Пустая() и Исполнитель.Пустая() Тогда
			Если не пост.Пустая() Тогда
				ОблКому.Параметры.Кому = Пост;
			Иначе
				ОблКому.Параметры.Кому = Пользователь;
			КонецЕсли;
		ИначеЕсли не ИсполнительЗРС.Пустая() Тогда
			ОблКому.Параметры.Кому = ИсполнительЗРС;
		Иначе
			ОблКому.Параметры.Кому = Исполнитель;
		КонецЕсли;
		
		ТабДок.Вывести(ОблКому);
	Иначе	
		Для Н = 2 По Маршрут.Количество() Цикл
			
			Если Н = Маршрут.Количество() Тогда
				Обл = Макет.ПолучитьОбласть("Кому");
				Обл.Параметры.Кому = Маршрут[Н-1].Пост;
			Иначе
				Обл = Макет.ПолучитьОбласть("ЧерезКого");
				Обл.Параметры.Пост = Маршрут[Н-1].Пост;
			КонецЕсли;
			
			ТабДок.Вывести(Обл);
		КонецЦикла;
	КонецЕсли;
	
	СитуацияТекст1 = ?(СитуацияТекст="", Ситуация, СитуацияТекст); 	
	ДанныеТекст1 = ?(ДанныеТекст="", Данные, ДанныеТекст); 	
	РешениеТекст1 = ?(СодержаниеТекст="", Содержание, СодержаниеТекст); 	
	
	ВывестиБлок("Ситуация",Макет,ТабДок,СитуацияТекст1);
	ВывестиБлок("Данные",Макет,ТабДок,ДанныеТекст1);
	ВывестиБлок("Решение",Макет,ТабДок,РешениеТекст1);
	
	облПодвал = Макет.ПолучитьОбласть("Подвал");
	облПодвал.Параметры.Заполнить(ЭтотОбъект);
	ТабДок.Вывести(облПодвал);
	
	
	Если Маршрут.Количество()>0 Тогда
		Для Н = 2 По Маршрут.Количество() Цикл
			ОблПодписи = Макет.ПолучитьОбласть("Подписи");
			ОблПодписи.Параметры.Пост = Маршрут[Н-1].Пост;
			
			Если Маршрут[Н-1].ВсеВерно Тогда
				ОблПодписи.Параметры.ПодписантОдобрено = Маршрут[Н-1].Пользователь;
			КонецЕсли;
			ТабДок.Вывести(ОблПодписи);
		КонецЦикла;
	Иначе
		ОблПодписи = Макет.ПолучитьОбласть("Подписи");
		ОблПодписи.Параметры.Пост = ""+Пост+" "+Исполнитель;
		
		Если ОтклонениеЗРС Тогда
			ОблПодписи.Параметры.ПодписантНеОдобрено = ИсполнительОтказЗРС;
		ИначеЕсли не Исполнитель.Пустая() Тогда
			ОблПодписи.Параметры.ПодписантОдобрено = Исполнитель;
		КонецЕсли;
		
			
		ТабДок.Вывести(ОблПодписи);
	КонецЕсли;
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	Возврат ТабДок;
	
КонецФункции

Функция ПечатьПослания() Экспорт
	
	Взаимодействия1с = Константы.КСУ_КЦ_ИспользоватьВзаимодействия1С.Получить();
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("МакетПослания");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Заполнить(ЭтотОбъект);
	ТабДок.Вывести(ОбластьШапка);
	
	ТекущийПользователь = ЭтотОбъект.Пользователь;
	ОбластьКому = Макет.ПолучитьОбласть("Кому");
	ОбластьКому.Параметры.Пользователь = ТекущийПользователь;
	ТабДок.Вывести(ОбластьКому);
	
	
	
	ОбластьПослание = Макет.ПолучитьОбласть("Послание");
	ОбластьПослание.Параметры.Содержание = ?(СодержаниеТекст="", Содержание, СодержаниеТекст);
	ТабДок.Вывести(ОбластьПослание);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Заполнить(ЭтотОбъект);
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	Возврат ТабДок;
	
КонецФункции

Процедура ВывестиБлок(ИмяБлока,Макет,ТабДокумент,ТекстБлока)
	Область = Макет.ПолучитьОбласть("Шапка" + ИмяБлока);
	ТабДокумент.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Строка" + ИмяБлока);
	Область.Параметры[ИмяБлока] = ТекстБлока;
	Если ТабДокумент.ПроверитьВывод(Область) Тогда 
		ТабДокумент.Вывести(Область);
	Иначе
		МассивСлов = ВернутьМассивСлов(ТекстБлока);
		ПоэтапныйВыводСлов(ТабДокумент,Макет,Область,МассивСлов,ИмяБлока,"Строка" + ИмяБлока);
	КонецЕсли;
КонецПроцедуры

Функция ВернутьМассивСлов(ИсходныйТекст)
	КолВо = СтрДлина(ИсходныйТекст);
	Слово = "";
	МассивСлов = Новый Массив;
	Для Сч = 1 По КолВо Цикл
		Буква = Сред(ИсходныйТекст,Сч,1);
		Если ЗначениеЗаполнено(Буква) Тогда 
			Слово = Слово + Буква;
		Иначе
			Если Слово <> "" Тогда
				МассивСлов.Добавить(Слово);
				Слово = "";
				МассивСлов.Добавить(Буква);//Добавляем пустые символы как отдельные слова
			Иначе
				МассивСлов.Добавить(Буква);//Добавляем пустые символы как отдельные слова
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Слово <> "" Тогда
		МассивСлов.Добавить(Слово);
	КонецЕсли;
	Возврат МассивСлов;
КонецФункции

Процедура ПоэтапныйВыводСлов(ТабДокумент,Макет,Область,МассивСлов,ИмяБлока,ИмяОбластиСтроки)
	ВремТекст = "";
	Для Каждого Эл Из МассивСлов Цикл
		Область.Параметры[ИмяБлока] = ВремТекст + Эл;
		Если НЕ ТабДокумент.ПроверитьВывод(Область) Тогда
			Область.Параметры[ИмяБлока] = ВремТекст;
			ТабДокумент.Вывести(Область);
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Область = Макет.ПолучитьОбласть(ИмяОбластиСтроки);
			ВремТекст = Эл;
		Иначе
			ВремТекст = ВремТекст + Эл;
		КонецЕсли;
	КонецЦикла;
	Область.Параметры[ИмяБлока] = ВремТекст;
	ТабДокумент.Вывести(Область);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	если ОбменДанными.Загрузка Тогда
		возврат;
	КонецЕсли;
	
	Если Пользователь.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИА_АдресацияЗадачПланаДействий.Пользователь
		|ИЗ
		|	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
		|ГДЕ
		|	ИА_АдресацияЗадачПланаДействий.Пост = &Пост
		|	И ИА_АдресацияЗадачПланаДействий.Пользователь <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
		Запрос.УстановитьПараметр("Пост", Пост);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ИА_ОбщиеПроцедуры_Технология_КоммЦентр_Сервер.ОбновитьДанныеКорзины("Входящие",,Выборка.Пользователь);
		КонецЦикла;
	Иначе
		ИА_ОбщиеПроцедуры_Технология_КоммЦентр_Сервер.ОбновитьДанныеКорзины("Входящие",,Пользователь);
	КонецЕсли;
	
	набор = РегистрыСведений.КСУ_СвязьЗадач.СоздатьНаборЗаписей();
	набор.Отбор.Задача1.Установить(Ссылка);
	набор.Очистить();
	Новстр = набор.Добавить();
	ЗаполнитьЗначенияСвойств(Новстр, ЭтотОбъект);
	Новстр.Задача1 = Ссылка;
	Новстр.Задача2 = Ссылка;
	
	Если ТипЗнч(Основание) = тип("ЗадачаСсылка.ИА_ЗадачаПланаДействий") И (не Основание.Пустая()) и Основание<>Ссылка ТОгда
		Новстр = набор.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, ЭтотОбъект);
		Новстр.Задача1 = Ссылка;
		Новстр.Задача2 = Основание;
	КонецЕсли;
	
	набор.Записать(истина);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда		
		Основание = ДанныеЗаполнения.Задача;                        
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.Задача, "Наименование,Содержание,Ситуация,Данные,ПрикрепленныйОбъект");
		Если ДанныеЗаполнения.вид = "ЗРС" Тогда
			ЭтоЗРС = истина;
		ИначеЕсли ДанныеЗаполнения.вид = "ПОСЛАНИЕ" Тогда
			ЭтоПослание = истина;
			Если Основание.ЭтоЗРС Тогда
				Содержание = "ЗРС-основание:"+Символы.ПС + "Ситуация: "+ Основание.Ситуация  +Символы.ПС + "Данные: " + Основание.Данные +Символы.ПС + "Решение: " + Основание.Содержание; 
			КонецЕсли;
		ИначеЕсли ДанныеЗаполнения.вид = "ЗАДАЧА" Тогда
			Если Основание.ЭтоЗРС Тогда
				Содержание = "ЗРС-основание:"+Символы.ПС + "Ситуация: "+ Основание.Ситуация  +Символы.ПС + "Данные: " + Основание.Данные +Символы.ПС + "Решение: " + Основание.Содержание; 
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьКоммент(Взаимодействия1с, Объект, Комментарий, получатель = Неопределено) Экспорт
	Если Взаимодействия1с Тогда
		ссылка1 = объект.ссылка;
		Если ссылка1.пустая() тогда
			ссылка1 = Объект.получитьссылкунового();
		КонецЕсли;
		ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ДобавитьЗаписьВЗадачу(ссылка1,Комментарий,получатель);
	Иначе
		Новстр = Объект.ХодВыполнения.Вставить(0);
		Новстр.Дата = ТекущаяДата();
		Новстр.Комментарий = Комментарий;
		Новстр.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры
